# Data Analysis Warmup Prject Exercises

In [1]:
import pandas as pd

In [2]:
import pandas as pd

dict1 = {
    "Name": [
        "Amit", "Rohit", "Pooja", "Neha", "Rahul", "Sneha", "Vikas", "Anjali", "Suresh", "Kiran",
        "Priya", "Manish", "Kavita", "Nikhil", "Rina", "Aakash", "Meena", "Sanjay", "Divya", "Arjun",
        "Swati", "Rakesh", "Komal", "Yogesh", "Payal", "Vivek", "Nisha", "Deepak", "Isha", "Mohit"
    ],
    "Marks": [
        78, 85, 92, 88, 76, 90, 81, 89, 73, 84,
        91, 79, 86, 87, 80, 93, 75, 82, 88, 90,
        77, 85, 83, 92, 89, 78, 84, 81, 90, 86
    ],
    "Gender": [
        "Male", "Male", "Female", "Female", "Male", "Female", "Male", "Female", "Male", "Male",
        "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male",
        "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Male"
    ]
}

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0     Amit     78    Male
1    Rohit     85    Male
2    Pooja     92  Female
3     Neha     88  Female
4    Rahul     76    Male
5    Sneha     90  Female
6    Vikas     81    Male
7   Anjali     89  Female
8   Suresh     73    Male
9    Kiran     84    Male
10   Priya     91  Female
11  Manish     79    Male
12  Kavita     86  Female
13  Nikhil     87    Male
14    Rina     80  Female
15  Aakash     93    Male
16   Meena     75  Female
17  Sanjay     82    Male
18   Divya     88  Female
19   Arjun     90    Male
20   Swati     77  Female
21  Rakesh     85    Male
22   Komal     83  Female
23  Yogesh     92    Male
24   Payal     89  Female
25   Vivek     78    Male
26   Nisha     84  Female
27  Deepak     81    Male
28    Isha     90  Female
29   Mohit     86    Male

### 1. Display Top 3 Rows of The Dataset

In [5]:
df1.head(3)

    Name  Marks  Gender
0   Amit     78    Male
1  Rohit     85    Male
2  Pooja     92  Female

### 2. Check Last 3 Rows of the Dataset

In [6]:
df1.tail(3)

      Name  Marks  Gender
27  Deepak     81    Male
28    Isha     90  Female
29   Mohit     86    Male

### 3. Find Shaoe of our Dataset (Number of Rows & Number of Columns)

In [8]:
df1.shape

print("Number of Rows", df1.shape[0])
print("Number of columns", df1.shape[1])

Number of Rows 30
Number of columns 3

### 4. Get Information About our Datset Like Total Number Rows,Total Numver of Columns, Datatype of Each Column and Memory Requirenment

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    30 non-null     object
 1   Marks   30 non-null     int64
 2   Gender  30 non-null     object
dtypes: int64(1), object(2)
memory usage: 852.0+ bytes

### 5. Check Null Values in Dataset

In [14]:
df1.isnull().sum(axis=0)  # axis=0     when we is this axis in sum() like o or 1 this return null values count in row by and coloumn by

Name      0
Marks     0
Gender    0
dtype: int64

### 6. Get Overall Statistics About The DataFrame

In [17]:
df1.describe()   # this function return only numeric columns  like in our dataset there is only on e marks column who having numeric values

           Marks
count  30.000000
mean   84.400000
std     5.611564
min    73.000000
25%    80.250000
50%    85.000000
75%    89.000000
max    93.000000

In [18]:
df1.describe(include = "all")

        Name      Marks Gender
count     30  30.000000     30
unique    30        NaN      2
top     Amit        NaN   Male
freq       1        NaN     16
mean     NaN  84.400000    NaN
std      NaN   5.611564    NaN
min      NaN  73.000000    NaN
25%      NaN  80.250000    NaN
50%      NaN  85.000000    NaN
75%      NaN  89.000000    NaN
max      NaN  93.000000    NaN

### 7. Find Unique Values From The Gender Column

In [19]:
df1

      Name  Marks  Gender
0     Amit     78    Male
1    Rohit     85    Male
2    Pooja     92  Female
3     Neha     88  Female
4    Rahul     76    Male
5    Sneha     90  Female
6    Vikas     81    Male
7   Anjali     89  Female
8   Suresh     73    Male
9    Kiran     84    Male
10   Priya     91  Female
11  Manish     79    Male
12  Kavita     86  Female
13  Nikhil     87    Male
14    Rina     80  Female
15  Aakash     93    Male
16   Meena     75  Female
17  Sanjay     82    Male
18   Divya     88  Female
19   Arjun     90    Male
20   Swati     77  Female
21  Rakesh     85    Male
22   Komal     83  Female
23  Yogesh     92    Male
24   Payal     89  Female
25   Vivek     78    Male
26   Nisha     84  Female
27  Deepak     81    Male
28    Isha     90  Female
29   Mohit     86    Male

In [20]:
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

### 8. Find the Number of Unique Values from the Gender column

In [24]:
df1["Gender"].nunique()

2

### 9. Display Count pf Unique Values in Gender Column

In [25]:
df1["Gender"].value_counts()

Gender
Male      16
Female    14
Name: count, dtype: int64

### 10. Find Total Number of students having marks between 90 to 100 (Inclusive) Using Between Methodm

In [29]:
df1[df1["Marks"]>=90]

      Name  Marks  Gender
2    Pooja     92  Female
5    Sneha     90  Female
10   Priya     91  Female
15  Aakash     93    Male
19   Arjun     90    Male
23  Yogesh     92    Male
28    Isha     90  Female

In [34]:
len(df1[(df1["Marks"] >= 90) & (df1["Marks"] <= 100)])

7

In [36]:
df1[df1["Marks"].between(90, 100)]

      Name  Marks  Gender
2    Pooja     92  Female
5    Sneha     90  Female
10   Priya     91  Female
15  Aakash     93    Male
19   Arjun     90    Male
23  Yogesh     92    Male
28    Isha     90  Female

### 11. Find Avg Marks

In [41]:
df1["Marks"].mean()
# df1["Marks"].min()
# df1["Marks"].max()
# df1["Marks"].std()

np.float64(84.4)

### 12. Apply Method

In [49]:
def marks(x):
    return x/2

In [50]:
df1["Half Marks"] = df1["Marks"].apply(marks)

In [46]:
df1

      Name  Marks  Gender  Half Marks
0     Amit     78    Male        39.0
1    Rohit     85    Male        42.5
2    Pooja     92  Female        46.0
3     Neha     88  Female        44.0
4    Rahul     76    Male        38.0
5    Sneha     90  Female        45.0
6    Vikas     81    Male        40.5
7   Anjali     89  Female        44.5
8   Suresh     73    Male        36.5
9    Kiran     84    Male        42.0
10   Priya     91  Female        45.5
11  Manish     79    Male        39.5
12  Kavita     86  Female        43.0
13  Nikhil     87    Male        43.5
14    Rina     80  Female        40.0
15  Aakash     93    Male        46.5
16   Meena     75  Female        37.5
17  Sanjay     82    Male        41.0
18   Divya     88  Female        44.0
19   Arjun     90    Male        45.0
20   Swati     77  Female        38.5
21  Rakesh     85    Male        42.5
22   Komal     83  Female        41.5
23  Yogesh     92    Male        46.0
24   Payal     89  Female        44.5
25   Vivek     78    Male        39.0
26   Nisha     84  Female        42.0
27  Deepak     81    Male        40.5
28    Isha     90  Female        45.0
29   Mohit     86    Male        43.0

In [51]:
df1["Marks"].apply(lambda x:x/2)

0     39.0
1     42.5
2     46.0
3     44.0
4     38.0
5     45.0
6     40.5
7     44.5
8     36.5
9     42.0
10    45.5
11    39.5
12    43.0
13    43.5
14    40.0
15    46.5
16    37.5
17    41.0
18    44.0
19    45.0
20    38.5
21    42.5
22    41.5
23    46.0
24    44.5
25    39.0
26    42.0
27    40.5
28    45.0
29    43.0
Name: Marks, dtype: float64

In [53]:
df1["Name"].apply(len)

0     4
1     5
2     5
3     4
4     5
5     5
6     5
7     6
8     6
9     5
10    5
11    6
12    6
13    6
14    4
15    6
16    5
17    6
18    5
19    5
20    5
21    6
22    5
23    6
24    5
25    5
26    5
27    6
28    4
29    5
Name: Name, dtype: int64

### 13. Map Function

In [57]:
df1["Male_Female"] = df1["Gender"].map({"Male":1,"Female":0})

In [58]:
df1

      Name  Marks  Gender  Half Marks  Male_Female
0     Amit     78    Male        39.0            1
1    Rohit     85    Male        42.5            1
2    Pooja     92  Female        46.0            0
3     Neha     88  Female        44.0            0
4    Rahul     76    Male        38.0            1
5    Sneha     90  Female        45.0            0
6    Vikas     81    Male        40.5            1
7   Anjali     89  Female        44.5            0
8   Suresh     73    Male        36.5            1
9    Kiran     84    Male        42.0            1
10   Priya     91  Female        45.5            0
11  Manish     79    Male        39.5            1
12  Kavita     86  Female        43.0            0
13  Nikhil     87    Male        43.5            1
14    Rina     80  Female        40.0            0
15  Aakash     93    Male        46.5            1
16   Meena     75  Female        37.5            0
17  Sanjay     82    Male        41.0            1
18   Divya     88  Female        44.0            0
19   Arjun     90    Male        45.0            1
20   Swati     77  Female        38.5            0
21  Rakesh     85    Male        42.5            1
22   Komal     83  Female        41.5            0
23  Yogesh     92    Male        46.0            1
24   Payal     89  Female        44.5            0
25   Vivek     78    Male        39.0            1
26   Nisha     84  Female        42.0            0
27  Deepak     81    Male        40.5            1
28    Isha     90  Female        45.0            0
29   Mohit     86    Male        43.0            1

### 14. Drop Columns

In [61]:
df1.drop("Male_Female", axis = 1)   # for single column

      Name  Marks  Gender  Half Marks
0     Amit     78    Male        39.0
1    Rohit     85    Male        42.5
2    Pooja     92  Female        46.0
3     Neha     88  Female        44.0
4    Rahul     76    Male        38.0
5    Sneha     90  Female        45.0
6    Vikas     81    Male        40.5
7   Anjali     89  Female        44.5
8   Suresh     73    Male        36.5
9    Kiran     84    Male        42.0
10   Priya     91  Female        45.5
11  Manish     79    Male        39.5
12  Kavita     86  Female        43.0
13  Nikhil     87    Male        43.5
14    Rina     80  Female        40.0
15  Aakash     93    Male        46.5
16   Meena     75  Female        37.5
17  Sanjay     82    Male        41.0
18   Divya     88  Female        44.0
19   Arjun     90    Male        45.0
20   Swati     77  Female        38.5
21  Rakesh     85    Male        42.5
22   Komal     83  Female        41.5
23  Yogesh     92    Male        46.0
24   Payal     89  Female        44.5
25   Vivek     78    Male        39.0
26   Nisha     84  Female        42.0
27  Deepak     81    Male        40.5
28    Isha     90  Female        45.0
29   Mohit     86    Male        43.0

In [ ]:
df1.drop(["Male_Female", "Half_Marks"], axis = 1)   # for Multiple column

In [ ]:
df1.drop(["Male_Female", "Half_Marks"], axis = 1, inplace = True)   # for Modifying Existing df

### 15. Print Name of the Columns

In [65]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half Marks', 'Male_Female'], dtype='object')

In [66]:
df1.index

RangeIndex(start=0, stop=30, step=1)

### 16.  Sort the DataFrame As PEr the Marks column

In [72]:
df1.sort_values(by = "Marks")

      Name  Marks  Gender  Half Marks  Male_Female
8   Suresh     73    Male        36.5            1
16   Meena     75  Female        37.5            0
4    Rahul     76    Male        38.0            1
20   Swati     77  Female        38.5            0
0     Amit     78    Male        39.0            1
25   Vivek     78    Male        39.0            1
11  Manish     79    Male        39.5            1
14    Rina     80  Female        40.0            0
27  Deepak     81    Male        40.5            1
6    Vikas     81    Male        40.5            1
17  Sanjay     82    Male        41.0            1
22   Komal     83  Female        41.5            0
9    Kiran     84    Male        42.0            1
26   Nisha     84  Female        42.0            0
21  Rakesh     85    Male        42.5            1
1    Rohit     85    Male        42.5            1
29   Mohit     86    Male        43.0            1
12  Kavita     86  Female        43.0            0
13  Nikhil     87    Male        43.5            1
18   Divya     88  Female        44.0            0
3     Neha     88  Female        44.0            0
7   Anjali     89  Female        44.5            0
24   Payal     89  Female        44.5            0
5    Sneha     90  Female        45.0            0
28    Isha     90  Female        45.0            0
19   Arjun     90    Male        45.0            1
10   Priya     91  Female        45.5            0
2    Pooja     92  Female        46.0            0
23  Yogesh     92    Male        46.0            1
15  Aakash     93    Male        46.5            1

In [73]:
df1.sort_values(by = "Marks", ascending = False)

      Name  Marks  Gender  Half Marks  Male_Female
15  Aakash     93    Male        46.5            1
2    Pooja     92  Female        46.0            0
23  Yogesh     92    Male        46.0            1
10   Priya     91  Female        45.5            0
5    Sneha     90  Female        45.0            0
28    Isha     90  Female        45.0            0
19   Arjun     90    Male        45.0            1
7   Anjali     89  Female        44.5            0
24   Payal     89  Female        44.5            0
18   Divya     88  Female        44.0            0
3     Neha     88  Female        44.0            0
13  Nikhil     87    Male        43.5            1
12  Kavita     86  Female        43.0            0
29   Mohit     86    Male        43.0            1
1    Rohit     85    Male        42.5            1
21  Rakesh     85    Male        42.5            1
26   Nisha     84  Female        42.0            0
9    Kiran     84    Male        42.0            1
22   Komal     83  Female        41.5            0
17  Sanjay     82    Male        41.0            1
6    Vikas     81    Male        40.5            1
27  Deepak     81    Male        40.5            1
14    Rina     80  Female        40.0            0
11  Manish     79    Male        39.5            1
0     Amit     78    Male        39.0            1
25   Vivek     78    Male        39.0            1
20   Swati     77  Female        38.5            0
4    Rahul     76    Male        38.0            1
16   Meena     75  Female        37.5            0
8   Suresh     73    Male        36.5            1

In [74]:
df1.sort_values(by = ["Gender","Marks"], ascending = False)

      Name  Marks  Gender  Half Marks  Male_Female
15  Aakash     93    Male        46.5            1
23  Yogesh     92    Male        46.0            1
19   Arjun     90    Male        45.0            1
13  Nikhil     87    Male        43.5            1
29   Mohit     86    Male        43.0            1
1    Rohit     85    Male        42.5            1
21  Rakesh     85    Male        42.5            1
9    Kiran     84    Male        42.0            1
17  Sanjay     82    Male        41.0            1
6    Vikas     81    Male        40.5            1
27  Deepak     81    Male        40.5            1
11  Manish     79    Male        39.5            1
0     Amit     78    Male        39.0            1
25   Vivek     78    Male        39.0            1
4    Rahul     76    Male        38.0            1
8   Suresh     73    Male        36.5            1
2    Pooja     92  Female        46.0            0
10   Priya     91  Female        45.5            0
5    Sneha     90  Female        45.0            0
28    Isha     90  Female        45.0            0
7   Anjali     89  Female        44.5            0
24   Payal     89  Female        44.5            0
3     Neha     88  Female        44.0            0
18   Divya     88  Female        44.0            0
12  Kavita     86  Female        43.0            0
26   Nisha     84  Female        42.0            0
22   Komal     83  Female        41.5            0
14    Rina     80  Female        40.0            0
20   Swati     77  Female        38.5            0
16   Meena     75  Female        37.5            0

### 17. Now Display Name & Marks of the Female Students

In [81]:
df1[df1["Gender"] == "Female"][["Name", "Marks"]]

      Name  Marks
2    Pooja     92
3     Neha     88
5    Sneha     90
7   Anjali     89
10   Priya     91
12  Kavita     86
14    Rina     80
16   Meena     75
18   Divya     88
20   Swati     77
22   Komal     83
24   Payal     89
26   Nisha     84
28    Isha     90

In [82]:
df1[df1["Gender"].isin(["Female"])][["Name", "Marks"]]

      Name  Marks
2    Pooja     92
3     Neha     88
5    Sneha     90
7   Anjali     89
10   Priya     91
12  Kavita     86
14    Rina     80
16   Meena     75
18   Divya     88
20   Swati     77
22   Komal     83
24   Payal     89
26   Nisha     84
28    Isha     90